# To make it so Homebrew can handle Brewfiles:
#   `tap Homebrew/bundle`
#   `brew bundle --file=~/.dotfiles/homebrew/.Brewfile`


# Add formulae that duplicate OS X software with updated versions:
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# all the things
brew 'coreutils'
brew 'findutils'
brew 'git'
brew 'tree'
brew 'htop'
brew 'ssh-copy-id'
brew 'wget'
brew 'ack'
brew 'tree'
brew 'stow'

# Python
brew 'python'
brew 'python3'

# mac apps
cask 'virtualbox'
cask 'google-chrome'
cask 'pycharm'
cask 'atom'
cask 'vagrant'
cask 'ksdiff'
cask 'spotify'
cask 'launchrocket'
cask 'slack'
cask 'iterm2'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
